"""
функции бывают разные
------------------
функция вызывается через def или async def
-----------------
что такое *args и **kwargs
*args используется когда мы не знаем, сколько будет надо будет передать аргументов, любое количество короче
числа переданные в функцию, есть *args собираются в котреж args И как бы дальше используются
аргументы идут по порядку, как и передал

**kwargs почти тоже самое, только передаётся именнованое аргументы
то есть в виде словаря и потом они собираются в словарь короче
всегда идёт после *args если они вместе
-----------------
что такое lambda функция?
это короче анонимная функция, создаётся с помощью ключевого слова lambda
по сути просто функция на одно действие, ламбда короче
форма объявления: 
lambda аргумент: выражение
вот и всё
"""