"""
существует ООП, классы и объекты
-----------------------
Класс - это шаблон для объектов. Или экземпляров класса. У класса есть методы и атрибуты.
-------------------
есть 4 основных принципа в ООП
1. Абстракция - это когда даём классу только пресущие ему свойства и не вдаёмся в детали.
2. Инкапсуляция - это когда скрываем внутренню работу и структуру класса и чтобы изменить что-то надо пользоваться методами.
3. Наследованое - это когда новые классы наследуют свойства, то есть атрибуты, и методы от их родительских классов.
4. Полиморфизм - значит, что методы разных объектов могут вести себя по-разному. По-сути использование одного и того же
интерфейса, но разная его реализация. 
-------------------
Дальше, что такое __init__ ??
Инит позволяет создавать объекты класса. То есть это обязательный метод класса, который позволяет создавать объекты. 
По сути, мы вызываем его каждый раз, когда создаём объект класса.
"""

class Car:
    def __init__(self, brand, color):
        self.brand = brand
        self.color = color

c = Car("Toyota", "red")

"""
Что такое метод __new__ ??
Очень редко юзается, сначала создаёт вызывается, потом инит.
Используется для создания и возвращения объекта.
Инит уже потом настраивает его и инициализирует.
--------------------------
какие знаешь магические методы и что это вообще?
есть много магических методов, это методы которые типо __
более глубокая настройка класса, к примеру через __str__ или __repr__
позволяют создавать свои типы данных, которые введут себя как встроенные
"""
