"""
короче бывают ошибки
------------------
изначально есть try except, они ловят ошибки, короче всё работает вот так:
try:
    # тут код, который может вызвать ошибку
except Ошибка:
    # что делать, если ошибка произошла
else:
    # (необязательно) — если ошибки НЕ было
finally:
    # (необязательно) — выполняется ВСЕГДА
------------------
теперь про типы исключений. Исключения - это ошибки, которая возникает во время выполнения программы. 
Если не обработать ошибка, программа завершится с трейсбеком
ValueError - неверное значение(тот тип, но не то)
TypeError - не тот тип данных
IndexError - индекс за пределами списка
KeyError - Нет такого ключа в словаре 
NameError - использование несуществующей переменной 
ZeroDivisionError - ошибка деления на ноль
и прочие прочие
------------------
Все ошибки, это объекты классов, унаследованных от BaseException
"""