"""
короче о декораторах
------------------
позволяют создавать функции, а потом дописывать к ним функционал
------------------
по сути, эта функция принимает другую функцию как аргумент, и возвращает новую функцию, обычно обёрнутую, с новой логикой
------------------
какие есть встроенные декораторы и что они делают?


@staticmethod - определяет метод в классе, которая не принимает self И работает как обычная функция, просто находясь внутри класса

@classmethod - позволяет методу получить доступ к самому классу, изменяя его, через первый аргумент cls

@property - позволяет обращаться к методу как к обычному атрибуту - без круглых скобок
"""